Repository: yuWorm/wslc-desktop
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# StartupOverlayTitle.Text
source: Checking WSLC
zh_cn: 正在检测 WSLC

# StartupOverlayDescription.Text
source: Verifying the Windows system-level container runtime before opening the app.
zh_cn: 正在验证 Windows 系统级容器运行时，通过后再进入应用。

# WslcRequiredDialogTitle
source: WSLC is required
zh_cn: 需要 WSLC

# WslcRequiredMissingWslMessage
source: WSLC currently requires the WSL pre-release build. Install or update WSL with the commands below before using WSLC Desktop.
zh_cn: WSLC 目前需要 WSL 预览版。请先使用下面的命令安装或更新 WSL，然后再使用 WSLC Desktop。

# WslcRequiredUpdateRequiredMessage
source: WSL is installed, but wslc.exe is missing. Update WSL to the pre-release build, then install WSLC if required.
zh_cn: 已检测到 WSL，但缺少 wslc.exe。请先将 WSL 更新到预览版，如仍缺失再安装 WSLC。

# WslcRequiredUpdateRequiredWithVersion
source: WSL is installed, but wslc.exe is missing. Update WSL to the pre-release build, then install WSLC if required. Detected: {0}
zh_cn: 已检测到 WSL，但缺少 wslc.exe。请先将 WSL 更新到预览版，如仍缺失再安装 WSLC。检测到：{0}

# WslcRequiredTimedOutMessage
source: WSLC prerequisite check timed out. Run the commands below, then recheck.
zh_cn: WSLC 前置检查超时。请运行下面的命令，然后重新检测。

# WslcRequiredCommandHeader
source: Run these commands in Windows Terminal, one line at a time:
zh_cn: 请在 Windows Terminal 中逐行运行这些命令：

source: Recheck
zh_cn: 重新检测

source: Copy command
zh_cn: 复制命令

# ShellStatusFlyoutTitle.Text
source: Runtime status
zh_cn: 运行状态

# ShellStatusBackendLabel.Text
source: Backend
zh_cn: 后端

# ShellStatusRuntimeLabel.Text
source: Runtime
zh_cn: 运行时

# ShellStatusPipeLabel.Text
source: Pipe
zh_cn: 管道

# ShellStatusMessageLabel.Text
source: Message
zh_cn: 消息

# ShellStatusLogsLabel.Text
source: Logs
zh_cn: 日志

# ShellStatusRefreshText.Text
source: Refresh
zh_cn: 刷新

# ShellStatusStartText.Text
source: Start
zh_cn: 启动

# ShellStatusRestartText.Text
source: Restart
zh_cn: 重启

# ShellStatusStopText.Text
source: Stop
zh_cn: 关闭

# ShellStatusSettingsText.Text
source: Settings
zh_cn: 设置

# TrayMainWindowItem.Text
source: Main window
zh_cn: 主窗口

# TraySettingsItem.Text
source: Settings
zh_cn: 设置

# TrayStartDaemonItem.Text
source: Start daemon
zh_cn: 启动 daemon

# TrayRestartDaemonItem.Text
source: Restart daemon
zh_cn: 重启 daemon

# TrayStopDaemonItem.Text
source: Stop daemon
zh_cn: 关闭 daemon

# TrayExitItem.Text
source: Exit
zh_cn: 退出

# NavContainers.Content
source: Containers
zh_cn: 容器

# NavImages.Content
source: Images
zh_cn: 镜像

# NavVolumes.Content
source: Volumes
zh_cn: 数据卷

# NavNetworks.Content
source: Networks
zh_cn: 网络

# RefreshButtonText.Text
source: Refresh
zh_cn: 刷新

# DeleteButtonText.Text
source: Delete
zh_cn: 删除

# DeleteCommand.Label
source: Delete
zh_cn: 删除

# ColumnName.Text
source: NAME
zh_cn: 名称

# ColumnImage.Text
source: IMAGE
zh_cn: 镜像

# ColumnMemory.Text
source: MEMORY
zh_cn: 内存

# ColumnPorts.Text
source: PORTS
zh_cn: 端口

# ColumnRepository.Text
source: REPOSITORY
zh_cn: 仓库

# ColumnImageId.Text
source: IMAGE ID
zh_cn: 镜像 ID

# ColumnSize.Text
source: SIZE
zh_cn: 大小

# ColumnCreated.Text
source: CREATED
zh_cn: 创建时间

# ColumnActions.Text
source: ACTIONS
zh_cn: 操作

# ColumnType.Text
source: TYPE
zh_cn: 类型

# ColumnUsedBy.Text
source: USED BY
zh_cn: 使用方

# ColumnDependsOn.Text
source: DEPENDS ON
zh_cn: 依赖

# ContainersTitle.Text
source: Containers
zh_cn: 容器

# ContainersSubtitle.Text
source: Manage WSLC container lifecycle, logs, terminals, ports, mounts, and environment.
zh_cn: 管理 WSLC 容器生命周期、日志、终端、端口、挂载和环境变量。

# ContainersLoadFailedInfo.Title
source: Container load failed
zh_cn: 容器加载失败

# ContainersNewButtonText.Text
source: New Container
zh_cn: 新建容器

# ContainersSearchBox.PlaceholderText
source: Search containers
zh_cn: 搜索容器

# ContainersFilterAll.Content
source: All
zh_cn: 全部

# ContainersFilterRunning.Content
source: Running
zh_cn: 运行中

# ContainersFilterStopped.Content
source: Stopped
zh_cn: 已停止

# ContainersStartCommand.Label
source: Start
zh_cn: 启动

# ContainersStopCommand.Label
source: Stop
zh_cn: 停止

# ContainersRestartCommand.Label
source: Restart
zh_cn: 重启

# ContainersTerminalCommand.Label
source: Terminal
zh_cn: 终端

# ContainersLogsCommand.Label
source: Logs
zh_cn: 日志

# ContainerNameInput.Header
source: Name
zh_cn: 名称

# ContainerImageInput.Header
source: Image
zh_cn: 镜像

# ContainerCommandInput.Header
source: Command
zh_cn: 命令

# ContainerPortsInput.Header
source: Ports
zh_cn: 端口

# ContainerMountsInput.Header
source: Mounts
zh_cn: 挂载

# ContainersStateInfo.Title
source: Container state
zh_cn: 容器状态

# ColumnState.Text
source: STATE
zh_cn: 状态

# ContainerDetailImageLabel.Text
source: Image
zh_cn: 镜像

# ContainerDetailCommandLabel.Text
source: Command
zh_cn: 命令

# ContainerDetailPortsLabel.Text
source: Ports
zh_cn: 端口

# ContainerDetailStateLabel.Text
source: State
zh_cn: 状态

# ContainerDetailCreatedLabel.Text
source: Created
zh_cn: 创建时间

# ContainerDetailUptimeLabel.Text
source: Uptime
zh_cn: 运行时长

# ContainersOverviewTab.Header
source: Overview
zh_cn: 概览

# ContainersStatsTab.Header
source: Stats
zh_cn: 统计

# ContainersLogsTab.Header
source: Logs
zh_cn: 日志

# ContainersTerminalTab.Header
source: Terminal
zh_cn: 终端

# ContainersInspectTab.Header
source: Inspect
zh_cn: 检查

# ContainersOverviewSelector.Text
source: Overview
zh_cn: 概览

# ContainersStatsSelector.Text
source: Stats
zh_cn: 统计

# ContainersLogsSelector.Text
source: Logs
zh_cn: 日志

# ContainersTerminalSelector.Text
source: Terminal
zh_cn: 终端

# ContainersEnvSelector.Text
source: Env
zh_cn: 环境

# ContainersInspectSelector.Text
source: Inspect
zh_cn: 检查

# ContainersOverviewQuickActionsHeading.Text
source: Quick actions
zh_cn: 快捷操作

# ContainersOverviewOpenTerminalButtonText.Text
source: Open Terminal
zh_cn: 打开终端

# ContainersPortsHeading.Text
source: Published ports
zh_cn: 已发布端口

# ContainersLogsPreviewHeading.Text
source: Logs preview
zh_cn: 日志预览

# ContainersTerminalPreviewHeading.Text
source: Terminal
zh_cn: 终端

# ContainersEnvHeading.Text
source: Environment
zh_cn: 环境变量

# ContainersInspectPreviewHeading.Text
source: Inspect preview
zh_cn: 检查预览

# ContainersExpandLogsButton.Content
source: Expand
zh_cn: 展开

# ContainersExpandTerminalButton.Content
source: Expand
zh_cn: 展开

# ContainersExpandInspectButton.Content
source: Expand
zh_cn: 展开

# ConnectTerminalButton.Label
source: Embedded Preview
zh_cn: 内嵌预览

# DisconnectTerminalButton.Label
source: Disconnect
zh_cn: 断开

# ExternalTerminalButton.Label
source: Open Terminal
zh_cn: 打开终端

# TerminalCapabilityInfo.Message
source: Open Terminal launches a real interactive shell in Windows Terminal. Embedded Preview is a fallback transcript.
zh_cn: 打开终端会在 Windows Terminal 中启动真实交互式 Shell。内嵌预览仅作为 transcript 备用方案。

# TerminalInputLine.Header
source: Input
zh_cn: 输入

# ContainersExternalTerminalButtonText.Text
source: External
zh_cn: 外部

# ContainersStatsSnapshotInfo.Message
source: Current wslc stats snapshots are shown here; historical charts can be added later.
zh_cn: 这里显示当前 wslc stats 快照；后续可增加历史趋势图。

# ImagesTitle.Text
source: Images
zh_cn: 镜像

# ImagesSubtitle.Text
source: Pull, tag, inspect, run, delete, and prune WSLC images.
zh_cn: 拉取、标记、检查、运行、删除和清理 WSLC 镜像。

# ImagesLoadFailedInfo.Title
source: Image load failed
zh_cn: 镜像加载失败

# ImagesPullButtonText.Text
source: Pull Image
zh_cn: 拉取镜像

# ImagesSearchBox.PlaceholderText
source: Filter...
zh_cn: 筛选...

# ColumnInUse.Text
source: IN USE
zh_cn: 使用状态

# ImagesInfo.Title
source: WSLC images
zh_cn: WSLC 镜像

# ImagesReferenceInput.Header
source: Image reference
zh_cn: 镜像引用

# ImagesPullTasksTitle.Text
source: Pull tasks
zh_cn: 拉取任务

# ImagesEmptyInfo.Title
source: No images
zh_cn: 没有镜像

# ImagesEmptyInfo.Message
source: Pull an image with wslc to populate this list.
zh_cn: 使用 wslc 拉取镜像后，此列表会显示内容。

# VolumesTitle.Text
source: Volumes
zh_cn: 数据卷

# VolumesSubtitle.Text
source: Track named volumes, bind mounts, usage, and safe cleanup.
zh_cn: 跟踪命名数据卷、绑定挂载、使用情况和安全清理。

# VolumesLoadFailedInfo.Title
source: Volume load failed
zh_cn: 数据卷加载失败

# VolumesNewButtonText.Text
source: New Volume
zh_cn: 新建数据卷

# VolumesSearchBox.PlaceholderText
source: Filter...
zh_cn: 筛选...

# VolumesTrackedInfo.Title
source: Tracked mounts
zh_cn: 已跟踪挂载

# VolumesEmptyInfo.Title
source: No mounts
zh_cn: 没有挂载

# VolumesEmptyInfo.Message
source: Create a container with a mount mapping such as C:\data=>/data to populate this view.
zh_cn: 创建带有 C:\data=>/data 等挂载映射的容器后，此视图会显示内容。

# VolumeNameInput.Header
source: Name
zh_cn: 名称

# VolumeSizeInput.Header
source: Size MB
zh_cn: 大小 MB

# ColumnDriver.Text
source: DRIVER
zh_cn: 驱动

# NetworksTitle.Text
source: Networks
zh_cn: 网络

# NetworksSubtitle.Text
source: Inspect published ports, localhost endpoints, and conflicts.
zh_cn: 检查已发布端口、本地主机端点和冲突。

# NetworksLoadFailedInfo.Title
source: Network load failed
zh_cn: 网络加载失败

# NetworksSearchBox.PlaceholderText
source: Filter...
zh_cn: 筛选...

# NetworksNewButtonText.Text
source: New Network
zh_cn: 新建网络

# NetworksPublishedPortsHeading.Text
source: Published Ports
zh_cn: 已发布端口

# NetworksPublishedPortsInfo.Title
source: Published ports
zh_cn: 已发布端口

# NetworksEmptyInfo.Title
source: No published ports
zh_cn: 没有已发布端口

# NetworksEmptyInfo.Message
source: Published port data appears after containers are created with port mappings.
zh_cn: 创建带端口映射的容器后，会显示已发布端口数据。

# ColumnContainer.Text
source: CONTAINER
zh_cn: 容器

# ColumnHostPort.Text
source: HOST PORT
zh_cn: 主机端口

# ColumnContainerPort.Text
source: CONTAINER PORT
zh_cn: 容器端口

# ColumnProtocol.Text
source: PROTOCOL
zh_cn: 协议

# NetworksFutureHeading.Text
source: Future Integrations
zh_cn: 未来集成

# NetworksFutureDns.Text
source: Local DNS aliases
zh_cn: 本地 DNS 别名

# NetworksFutureHttps.Text
source: HTTPS with explicit local CA consent
zh_cn: 需明确同意的本地 CA HTTPS

# NetworksFuturePortEditor.Text
source: Port forwarding rule editor
zh_cn: 端口转发规则编辑器

# ComposeSubtitle.Text
source: Open a compose file, preview service plans, then create WSLC containers.
zh_cn: 打开 compose 文件，预览服务计划，然后创建 WSLC 容器。

# ComposeLoadFailedInfo.Title
source: Compose load failed
zh_cn: Compose 加载失败

# ComposeSearchBox.PlaceholderText
source: Filter...
zh_cn: 筛选...

# ComposeOpenButtonText.Text
source: Open Compose
zh_cn: 打开 Compose

# ComposeCreateStartButtonText.Text
source: Create & Start
zh_cn: 创建并启动

# ComposePreviewInfo.Title
source: Compose preview
zh_cn: Compose 预览

# ComposeEmptyInfo.Title
source: No compose plan
zh_cn: 没有 Compose 计划

# ComposeEmptyInfo.Message
source: Open a compose.yaml or compose.yml file to generate a service plan.
zh_cn: 打开 compose.yaml 或 compose.yml 文件以生成服务计划。

# ComposeSelectedFileInput.Header
source: Selected file
zh_cn: 已选择文件

# ComposeProjectsHeading.Text
source: Projects
zh_cn: 项目

# ComposeGeneratedPlanHeading.Text
source: Generated Plan
zh_cn: 生成的计划

# ColumnService.Text
source: SERVICE
zh_cn: 服务

# ColumnMounts.Text
source: MOUNTS
zh_cn: 挂载

# ComposeUnsupportedRun.Text
source: · unsupported:
zh_cn: · 不支持：

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# SettingsSubtitle.Text
source: Configure app storage, language, diagnostics, and terminal behavior.
zh_cn: 配置应用存储、语言、诊断和终端行为。

# SettingsFailedInfo.Title
source: Settings failed
zh_cn: 设置失败

# SettingsSessionHeading.Text
source: Application
zh_cn: 应用

# SettingsInfo.Title
source: Settings
zh_cn: 设置

# SettingsDataRoot.Header
source: App data root
zh_cn: 应用数据目录

# SettingsLanguage.Header
source: Language
zh_cn: 语言

# SettingsLanguageSystem.Content
source: System
zh_cn: 跟随系统

# SettingsLaunchAtLogin.Header
source: Launch at sign-in
zh_cn: 登录时启动

# SettingsCliToolsHeading.Text
source: CLI tools
zh_cn: CLI 工具

# SettingsCliToolsDescription.Text
source: Install Docker CLI helpers used by external docker and docker compose commands.
zh_cn: 安装外部 docker 和 docker compose 命令使用的 Docker CLI 辅助工具。

# SettingsCliToolsStatusInfo.Title
source: CLI tools status
zh_cn: CLI 工具状态

# SettingsCliToolsBinLabel.Text
source: Install directory
zh_cn: 安装目录

# SettingsCliToolsRefreshText.Text
source: Refresh
zh_cn: 刷新

# SettingsCliToolsManageText.Text
source: Install / Manage CLI tools
zh_cn: 安装 / 管理 CLI 工具

# SettingsCliToolsDockerContextText.Text
source: Use WSLC Desktop Docker context
zh_cn: 使用 WSLC Desktop Docker context

# SettingsCliToolsInstallDockerText.Text
source: Install Docker CLI
zh_cn: 安装 Docker CLI

# SettingsCliToolsInstallDockerZipText.Text
source: Install Docker ZIP
zh_cn: 安装 Docker ZIP

# SettingsCliToolsInstallComposeText.Text
source: Install Compose
zh_cn: 安装 Compose

# SettingsCliToolsInstallComposeExeText.Text
source: Select Compose EXE
zh_cn: 选择 Compose EXE

# SettingsCliToolsAddPathText.Text
source: Add user PATH
zh_cn: 添加用户 PATH

# SettingsCliToolsAddSystemPathText.Text
source: Add system PATH
zh_cn: 添加系统 PATH

# SettingsRuntimeProviderHeading.Text
source: Runtime provider
zh_cn: 运行时 Provider

# SettingsWslcSpecialDescription.Text
source: WSLC CLI commands inherit these proxy, mirror, and environment settings through the daemon process.
zh_cn: WSLC CLI 命令会通过 daemon 进程继承这些代理、镜像和环境变量设置。

# SettingsWslcHttpProxy.Header
source: HTTP proxy
zh_cn: HTTP 代理

# SettingsWslcHttpsProxy.Header
source: HTTPS proxy
zh_cn: HTTPS 代理

# SettingsWslcImageMirror.Header
source: Image mirror
zh_cn: 镜像代理

# SettingsWslcRewriteImageTag.Header
source: Rename image tag after pull
zh_cn: 拉取后重命名镜像 tag

# SettingsWslcRemoveRewrittenSourceTag.Header
source: Delete original tag after rename
zh_cn: 重命名后删除原 tag

# SettingsWslcEnvironment.Header
source: Execution environment
zh_cn: 执行环境变量

# SettingsDockerConfigDescription.Text
source: Docker API provider settings are managed by Docker-compatible engines outside WSLC Desktop.
zh_cn: Docker API Provider 的设置由 WSLC Desktop 之外的 Docker 兼容引擎管理。

# SettingsAllowTcpDockerApi.Header
source: Allow TCP Docker API host
zh_cn: 允许 TCP Docker API Host

# SettingsOpenDockerConfigText.Text
source: Open Docker config
zh_cn: 打开 Docker 配置

# SettingsProviderPreviewInfo.Title
source: Provider preview
zh_cn: Provider 预览

# SettingsTestProviderButtonText.Text
source: Test Provider
zh_cn: 测试 Provider

# SettingsTerminalHeading.Text
source: Terminal
zh_cn: 终端

# SettingsDefaultShell.Header
source: Default shell
zh_cn: 默认 Shell

# SettingsExternalTerminal.Header
source: Open external Windows Terminal when available
zh_cn: 可用时打开外部 Windows Terminal

# SettingsSaveButtonText.Text
source: Save Settings
zh_cn: 保存设置

# SettingsDiagnosticsHeading.Text
source: Diagnostics
zh_cn: 诊断

# SettingsDiagnosticsDescription.Text
source: Export host readiness, settings, recent operations, compose projects, volumes, and published ports.
zh_cn: 导出主机就绪状态、设置、最近操作、Compose 项目、数据卷和已发布端口。

# SettingsExportDiagnosticsText.Text
source: Export Diagnostics
zh_cn: 导出诊断

# SettingsDaemonHeading.Text
source: Daemon management
zh_cn: Daemon 管理

# SettingsDaemonDescription.Text
source: Start, restart, or stop the local wslcd-desktop daemon used by the app and Docker-compatible pipe.
zh_cn: 启动、重启或关闭应用和 Docker 兼容管道使用的本地 wslcd-desktop daemon。

# SettingsDaemonStatusInfo.Title
source: Daemon status
zh_cn: Daemon 状态

# SettingsStartDaemonText.Text
source: Start wslcd-desktop
zh_cn: 启动 wslcd-desktop

# SettingsRestartDaemonText.Text
source: Restart wslcd-desktop
zh_cn: 重启 wslcd-desktop

# SettingsStopDaemonText.Text
source: Stop wslcd-desktop
zh_cn: 关闭 wslcd-desktop

# DaemonStartDialogTitle
source: Start wslcd-desktop?
zh_cn: 启动 wslcd-desktop？

# DaemonStartDialogContent
source: These settings apply when wslcd-desktop starts. Start the daemon now?
zh_cn: 这些设置会在 wslcd-desktop 启动时生效。是否现在启动 daemon？

# DaemonRestartDialogTitle
source: Restart wslcd-desktop?
zh_cn: 重启 wslcd-desktop？

# DaemonRestartDialogContent
source: This stops existing daemon processes and starts a fresh wslcd-desktop instance. Active Docker CLI calls may be interrupted.
zh_cn: 这会停止现有 daemon 进程并启动新的 wslcd-desktop 实例。正在运行的 Docker CLI 调用可能会中断。

# DaemonStopDialogTitle
source: Stop wslcd-desktop?
zh_cn: 关闭 wslcd-desktop？

# DaemonStopDialogContent
source: This stops existing daemon processes and leaves the daemon offline until you start it again or another app workflow starts it.
zh_cn: 这会停止现有 daemon 进程，并保持离线，直到你再次启动或其他应用工作流重新拉起它。
